# x = 7
# if x == 5:
#     print("Я не сработаю😰")
# elif x > 5:
#     print("Я, вероятно сработаю🤓")
#
# word_1 = input("Введи слово (1/2): ")
# word_2 = input("Введи слово (2/2): ")
#
# word_1 = word_1.lower()
# word_2 = word_2.lower()
#
# if word_1.isalpha() and word_2.isalpha():
#
#         sorted_w1 = sorted(word_1)
#         sorted_w2 = sorted(word_2)
#
#      print(sorted_w1)
#      print(sorted_w2)
#     if sorted_w1 == sorted_w2:
#          print("Ура, у вас анаграма😎")
#      else:
#         print("Ну не фортануло, не получилось😖: ")



 # q1 = input("Сколько будит 2 + 2\n"
 #            "а) 4\n"
 #            "б) 5\n"
 #            "--> ")
 # if q1 == "а" or q1 == "4":
 #     print("правильна😎")
 # else:
 #     print("Одна ошибка и ты ошибся 🐺")
 #     quit()
 #
 # q2 = input("Арбуз это - ...?\n"
 #            "а) корнеплод\n"
 #            "б) овощ\n"
 #            "в) то от чего обоссышся\n"
 #            "г) ягода\n"
 #            "--> ")
 # if q2 == "г":
 #     print("правильна😎")
 # else:
 # print("Одна ошибка и ты ошибся 🐺")
 #     quit()
 # q3 = input("Цугцванг - это ...?\n"
 #            "а) bel çantası\n"
 #            "б) положение в шашках и шахматах, в котором любой ход игрока ведёт к ухудшению его позиции\n"
 #            "в) жанр аниме, посвященный Егору\n"
 #            "г) парода обезьян\n"
 #            "-->")
 # if q3 == "б":
 #     print("Ну как бы да, в общем-то правильно ")
 # elif q3 == "в":
 #     print("Партия гордится тобой. Плюс второй порция миска рис.")
 # else:
 #     print("Ну нет, правильный ответ был 'в'")
#
#print("Ты победил, респектуха")

































































































